export interface Region {
  name: string
  districts: string[]
}

export const regions: Region[] = [
  {
    name: '杭州',
    districts: ['上城', '拱墅', '西湖', '滨江', '萧山', '余杭', '临平', '钱塘', '富阳', '临安', '桐庐', '淳安', '建德']
  },
  {
    name: '宁波',
    districts: ['海曙', '江北', '镇海', '北仑', '鄞州', '奉化', '余姚', '慈溪', '宁海', '象山']
  },
  {
    name: '嘉兴',
    districts: ['南湖', '秀洲', '嘉善', '海盐', '海宁', '平湖', '桐乡']
  },
  {
    name: '温州',
    districts: ['鹿城', '龙湾', '瓯海', '洞头', '瑞安', '乐清', '龙港', '永嘉', '平阳', '苍南', '文成', '泰顺']
  },
  {
    name: '绍兴',
    districts: ['越城', '柯桥', '上虞', '诸暨', '嵊州', '新昌']
  },
  {
    name: '湖州',
    districts: ['吴兴', '南浔', '德清', '长兴', '安吉']
  },
  {
    name: '金华',
    districts: ['婺城', '金东', '兰溪', '义乌', '东阳', '永康', '武义', '浦江', '磐安']
  },
  {
    name: '台州',
    districts: ['椒江', '黄岩', '路桥', '温岭', '临海', '玉环', '天台', '仙居', '三门']
  },
  {
    name: '衢州',
    districts: ['柯城', '衢江', '江山', '常山', '开化', '龙游']
  },
  {
    name: '丽水',
    districts: ['莲都', '龙泉', '青田', '缙云', '遂昌', '松阳', '云和', '庆元', '景宁']
  },
  {
    name: '舟山',
    districts: ['定海', '普陀', '岱山', '嵊泗']
  }
]

export const ACTIVE_REGION = '奉化'
